Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/product_safety_and_labelling/safety_of_electrical_and_gas_products_and_furniture.html.txt.tmx
Source language: en
Languages: ga

source: Safety of electrical and gas products and furniture
ga: Sábháilteacht Táirgí Leictreacha agus Gáis agus Troscáin

source: Electrical and gas products for sale and in use throughout the EU are subject to safety standards
ga: Bíonn táirgí leictreacha agus gáis a bhíonn ar díol agus a bhíonn in úsáid ar fud an AE faoi réir ag caighdeáin sábháilteachta

source: These standards aim to protect consumers and prevent or reduce the risk of injury to anyone using these products
ga: Tá sé mar aidhm ag na caighdeáin sin cosaint a thabhairt do thomhaltóirí agus an baol gortaithe atá ann d’aon duine a úsáideann na táirgí seo a chosc nó a laghdú

source: The following is an overview of the main provisions of the law concerning these standards
ga: Is forbhreathnú é seo a leanas ar na príomhforálacha den dlí a bhaineann leis na caighdeáin sin

source: EU and Irish legislation sets down safety standards for electrical products in use and for sale in Ireland and throughout the EU member states
ga: Leagann reachtaíocht an AE agus reachtaíocht na hÉireann síos caighdeáin sábháilteachta do tháirgí leictreacha a úsáidtear agus a dhíoltar in Éirinn agus ar fud Bhallstáit eile an AE

source: S.I 428 of 1992 The Low Voltage Electrical Equipment Directive and subsequent amendments (S.I
ga: Tá sé mar aidhm ag I.R 428 de 1992 Treoir Trealamh Leictreach Ísealvoltais agus ag leasuithe ina dhiaidh sin (I.R

source: No 307 of 1994) aim to ensure that all electrical equipment placed on the market in the European Union complies with health and safety standards
ga: Uimh 307 de 1994) chun a chinntiú go gcomhlíonann gach trealamh leictreach a chuirtear ar an margadh san Aontas Eorpach caighdeáin sláinte agus sábháilteachta

source: In general, electrical equipment for use at home must not unduly endanger people, domestic animals or property
ga: Níor chóir tríd is tríd, go gcuirfeadh trealamh leictreach a úsáidtear sa bhaile daoine, ainmhithe tí ná maoin i gcontúirt in aon turas

source: Specifically, electrical products must not give rise to hazards either by:
ga: Go sonrach, níor chóir go dtarlódh guais de bharr táirgí leictreacha trí:

source: • the equipment itself (for example, an electrical product overheating and so becoming a hazard)
ga: • an trealamh é féin (mar shampla, táirgí leictreacha a bheith ag téamh an iomarca agus mar sin é a bheith ina ghuais)

source: • the equipment’s interaction with the environment (for example a product being dangerous when carrying out its purpose – a kettle leaking and so becoming a hazard when water is being boiled)
ga: • trí idirghníomhú an trealaimh leis an gcomhshaol (mar shampla táirge atá contúirteach agus é ag obair – citeal ag ligean uisce amach agus é a bheith ina chontúirt nuair a fhiuchtar uisce ann

source: The law states that electrical equipment can be presumed to be safe but must be used for the purposes for which it is intended
ga: Maítear sa dlí gur féidir glacadh leis go mbíonn trealamh leictreach sábháilte ach nach mór é a úsáid chun na críocha a bhfuil sé leagtha amach lena n-aghaidh

source: Consumers therefore, should heed warnings that appear on products
ga: Mar sin ní mór do thomhaltóir aird a thabhairt ar rabhadh a bhíonn le feiceáil ar tháirgí

source: (For example, warnings on hairdryers such as ‘not for use in bathrooms’ etc)
ga: (Mar shampla, rabhadh a bhí ar thriomadóirí gruaige mar ‘ní ceadmhach é a úsáid i seomra folctha' srl.)

source: As plugs, sockets and leads in Ireland are different to the rest of Europe the National Standards Authority of Ireland has developed electricity standards to ensure that safety standards are met
ga: De bhrí go bhfuil plocóidí, soicéid agus seoláin difriúil in Éirinn ón gcuid eile den Eoraip tá caighdeáin leictreachais forbartha ag Údarás Caighdeán na hÉireann lena chinntiú go gcomhlíontar caighdeáin sábháilteachta

source: The specific standards covering them are:
ga: Is iad na caighdeáin sonracha lena gclúdaítear iad ná:

source: • SI 222 1969 (IS 167) Electrical Appliances – Colour code for three core leads and
ga: • IR 222 1969 (IS 167) Gairis Leictreacha – Cód daite do na trí phríomhsheolán agus

source: • SI 173 1987 (IS 401) Safety Requirements for Rewireable 13 A Fused Plugs for normal and rough use having insulation sleeves on line and neutral pins
ga: • IR 173 1987 (IS 401) Ceanglas Sábháilteachta do Phlocóidí Fiúis 13 A Athshreangaithe le haghaidh gnáth-úsáide agus úsáide gairbhe agus muinchille inslithe ar phionnaí line agus neodracha

source: The standard plugs in Ireland are 3 pin IS411 (BS 1363) type
ga: Is iad na plocóidí caighdeánacha a úsáidtear in Éirinn ná cinn 3 phionna IS411 (BS 1363)

source: You are entitled to expect that any electrical item that you buy in Ireland comes with a 3 pin plug
ga: Tá sé de cheart agat a bheith ag súil go mbeidh plocóid 3 phionna le haon ábhar leictreach a cheannaíonn tú in Éirinn

source: If it does not the item may be considered "not fit for its purpose" as per the Sale of Goods and Supply of Services Act, 1980
ga: Mura mbíonn sé sin leis, d’fhéadfaí an t-ábhar a bhreithniú mar ábhar "nach bhfuil ceart dá úsáid" de réir An tAcht um Dhíol Earraí agus Soláthar Seirbhísí 1980

source: Never attempt to place a two pin plug in a three pin socket
ga: Ná triail go deo plocóid dhá phionna a chur isteach i soicéad thrí phionna

source: The Electricity Supply Board has more information on Safety in the Home
ga: Tá breis eolais ag an mBord Soláthar Leictreachais um Shábháilteacht sa Bhaile

source: Gas burning appliances are also subject to stringent standards to ensure that they are safe for use in the home
ga: Bíonn gairis a dhónn gás freisin faoi réir ag caighdeáin diana lena chinntiú go mbíonn siad sábháilte le húsáid sa bhaile

source: A gas burning appliance covers items such as household heating boilers, gas cookers, gas lighting, gas-fired heaters, etc
ga: Clúdaíonn gaireas a lasann le gás rudaí ar nós coirí téimh a úsáidtear sa teach, bruthairí gáis, soilsiú gáis, téitheoirí gáis, srl

source: SI no 101 of 1992 and SI No 150 of 1995 lay out the requirements for manufacturers of gas burning appliances
ga: Leagann IR uimh 101 de 1992 agus IR Uimh 150 de 1995 amach na ceanglais do dhéantúsóirí gaireas gás-lasta

source: The requirements set down the standards regarding warning notices to be affixed to these appliances, the type of gas to be used, pressure levels, etc
ga: Leagann na ceanglais amach na caighdeáin maidir le fógraí rabhaidh a chaitear a ghreamú leis na gairis sin, an cineál gáis a úsáidfear, leibhéil bhrú, srl

source: All gas appliances produced since 1997 in use in the EU should carry the CE mark to show that they comply with these laws
ga: Ba chóir go mbeadh marc CE ar gach gaireas gáis a táirgeadh ó 1997 a úsáidtear san AE lena thaispeáint go gcomhlíonann siad na dlíthe sin

source: If you are having a gas appliance fitted it is a legal requirement that the installation be carried out by a registered gas installer
ga: Má tá tú ag cur isteach ghaireas gáis, is riachtanas dlíthiúil go shuiteálaí gáis cláraithe gairis gáis a shuiteáil

source: The Commission for Energy Regulation has appointed the Register of Gas Installers of Ireland (RGII) as the gas safety supervisory body
ga: Tá Clár na Suiteálaithe Gáis na hÉireann (RGII) ceaptha ag an gCoimisiún um Rialáil Fuinnimh mar an comhlacht maoirseachta sábháilteachta gáis

source: Companies working on gas installations, fitting of gas appliances or providing appliance servicing must be registered with RGII
ga: Bíonn comhlachtaí a oibríonn ar shuiteálacha gáis, a chuireann isteach gairis gáis nó a sholáthraíonn seirbhísiú gaireas cláraithe leis an RGII

source: To be registered the installer must meet the safety training and other requirements
ga: Le clárú ní mór don suiteálaí na ceanglais oiliúna sábháilteachta agus ceanglais eile

source: All electrical products and gas appliances should have a CE mark
ga: Ba chóir go mbeadh marc CE ar gach táirge leictreach agus gaireas gáis

source: The CE label means that the product conforms with all applicable health, safety and environmental protection standards of the European Union and of the Member State in which the item was bought
ga: Ciallaíonn an lipéad CE go gcomhlíonann an táirge gach caighdeán sláinte, sábháilteachta agus cosanta comhshaoil de chuid an Aontais Eorpaigh agus de chuid na mBallstát inar ceannaíodh an t-ábhar

source: The CE mark can appear on the item itself or on the packaging
ga: Is féidir leis an marc a bheith ar an ábhar é féin nó ar an bpacáistiú

source: Look for the CE mark before you buy electrical or gas products
ga: Coinnigh súil amach don mharc CE sula gceannaíonn tú táirgí leictreacha nó gáis

source: Fire Safety for furniture
ga: Sábháilteacht Dóiteáin do Throscán

source: 316 of 1995 the Industrial Research and Standards (Fire Safety) (Domestic Furniture) Order 1995 anyone manufacturing, selling or repairing furniture in Ireland is obliged to ensure materials used (including foams, fillings, coverings and frames) comply with safety standards
ga: 316 de 1995 an tOrdú um Chaighdeáin agus Taighde Tionsclaíoch (Sábháilteacht Dóiteáin) (Troscán Tí) 1995 bíonn oibleagáid ar aon duine a dhéanann troscán in Éirinn, a dhíolann é nó a dheisíonn troscán chun a chinntiú go gcomhlíonann na hábhair a úsáidtear (lena n-áirítear cúr, líonadh, clúdaigh agus frámaí) le caighdeáin sábháilteachta

source: Specifically, furniture must pass the ‘cigarette test’
ga: Go sonrach, caithfidh troscán teacht slán tríd an ‘tástáil toitíní’

source: This test proves that covers, foam and lining materials are not likely to go on fire by a lit match or a cigarette
ga: Cruthaíonn an tástáil sin nach bhfuil aon bhaol ann go rachaidh clúdaigh, cúr agus ábhair líneála trí thine ó chipín solais a bhíonn lasta nó ó thoitín

source: All furniture passing this test should be clearly labelled to indicate that it complies with Irish fire safety laws
ga: Ba chóir lipéad soiléir a chur ar gach troscán a théann tríd an tástáil seo chun a léiriú go gcomhlíonann sé le dlíthe sábháilteachta dóiteáin na hÉireann
